# BaseExportOptions Methods

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BaseExportOptions Methods
BaseExportOptions Class See Also
---
The BaseExportOptions type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetExportFontTable | Gets font table. |
| GetExportLayerTable | Gets the layer table. |
| GetExportLinetypeTable | Gets a copy of the line type table. |
| GetExportPatternTable | Gets a copy of the pattern table. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetPredefinedSetupNames | Returns a list of names of predefined setups of export options. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetExportFontTable | Sets font table to option. |
| SetExportLayerTable | Sets layer table back to option |
| SetExportLinetypeTable | Sets the line type table to use during export. |
| SetExportPatternTable | Sets the pattern table to use during export. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
BaseExportOptions Class
Autodesk.Revit.DB Namespace